WELCOME_MESSAGE = "សូមស្វាគមន៍មកកាន់ ការស្ទង់មតិ LMS\nសូមបញ្ចូលឈ្មោះពេញរបស់អ្នក៖\n(ឧទាហរណ៍. សុខ សុភា)\n\nសូមវាយពាក្យ /cancel ដើម្បីបោះបង់ការស្ទង់មតិ។"
ASK_SCHOOL_MESSAGE = "សូមបញ្ចូលសាលាដែលអ្នកបង្រៀន៖\n(ឧទាហរណ៍. សាលាបឋមសិក្សា វត្តបូព៌)"
ASK_CLASS_MESSAGE = "សូមបញ្ចូលថ្នាក់ដែលអ្នកបង្រៀន៖\n(ឧទាហរណ៍. 6 ខ)"


# Computer usage question (before main questions)
COMPUTER_USAGE_QUESTION = {
    "text": "១- តើលោកអ្នកធ្លាប់ប្រើប្រាស់កុំព្យូទ័រទេ?",
    "choices": ["ក. ធ្លាប់", "ខ. មិនធ្លាប់"],
}


QUESTIONS = {
    1: {
        "text": "១. ដើម្បីបង្កើតឯកសារថ្មី (Create New Document) អ្នកត្រូវ៖",
        "choices": [
            "ក. ចុច Start Menu → Microsoft Word",
            "ខ. ចុច File -> ជ្រើសរើស New (ថ្មី) -> Blank Document",
            "គ. ចុច File -> ជ្រើសរើស Save -> ដាក់ឈ្មោះឯកសារ -> Save",
        ],
    },
    2: {
        "text": "២. ដើម្បីរក្សាទុកការងារ ក្នុង Microsoft Word ត្រូវ៖",
        "choices": [
            "ក. ចុច File -> Save -> ដាក់ឈ្មោះឯកសារ -> Save ឬ Ctrl + S",
            "ខ. ចុច Ctrl + S",
            "គ. ចុច File → Save As -> ដាក់ឈ្មោះឯកសារ -> Save ឬ Ctrl + S",
        ],
    },
    3: {
        "text": "៣. ដើម្បីបើកឯកសាររក្សាទុកត្រូវប្រើ៖",
        "choices": [
            "ក. ចុច File → Print (បោះពុម្ភ)",
            "ខ. ចុច File → Open (បើក) -> ជ្រើសរើសឈ្មោះ -> Open",
            "គ. Home → Save",
        ],
    },
    4: {
        "text": "៤. តើ Microsoft Excel ត្រូវបានប្រើសម្រាប់អ្វីជាចម្បង?",
        "choices": ["ក. វាយអត្ថបទ", "ខ. គណនា និងវិភាគទិន្នន័យ", "គ. បង្កើតស្លាយ"],
    },
    5: {
        "text": "៥. ដើម្បីបូកលេខក្នុង Excel ត្រូវប្រើរូបមន្ត៖",
        "choices": [
            "ក. = Cell + Cell",
            "ខ. = Cell - Cell",
            "គ. = Cell + Cell ឬ =Sum(Cell:Cell)",
        ],
    },
    6: {
        "text": "៦. ដើម្បីចូលទៅក្នុងថ្នាលអប់រំឌីជីថលបានជំហានដំបូងតើយើងត្រូវធ្វើដូចម្តេច?",
        "choices": ["ក. Login user", "ខ. ចូលមើលវីដេអូមេរៀន", "គ. ធ្វើរង្វាយតម្លៃ"],
    },
    7: {
        "text": "៧. តើក្នុងថ្នាលអប់រំ EBC នៅក្នុងមួយមេរៀនមានប្រភេទខ្លឹមសារអ្វីខ្លះ?",
        "choices": [
            "ក. មានតែវីដេអូ",
            "ខ. វីដេអូ សង្ខេបមេរៀននិងរង្វាយតម្លៃ",
            "គ. វីដេអូ សង្ខេបមេរៀនរង្វាយតម្លៃ និងកិច្ចការផ្ទះ",
        ],
    },
    8: {
        "text": "៨. តើខ្លឹមសារមេរៀនក្នុងថ្នាលអប់រំ EBC ដកស្រង់ចេញពីណា?",
        "choices": ["ក. ចេញពីសៀវភៅពុម្ពរបស់ក្រសួង", "ខ. EBC បានតែងតែងឡើង", "គ. ចេញពីគ្រូល្បីៗ"],
    },
    9: {
        "text": "៩. តើនៅក្នុងថ្នាលអប់រំ EBC បានជួយការបង្រៀនរបស់លោកគ្រូអ្នកគ្រូ ប៉ុន្មានភាគរយ?",
        "choices": ["ក. ១០% ទៅ ៣០%", "ខ. ៤០% ទៅ ៦០%", "គ. ៧០% ទៅ ១០០%"],
    },
    10: {
        "text": "១០. សូមមេត្តាផ្តល់មតិយោបល់ ឬសំណូមពរ៖",
        "choices": [],
    },
}


THANK_YOU_MESSAGE = "សូមអរគុណ សម្រាប់ការផ្ដល់ព័ត៌មានរបស់អ្នក។ 🙏"
CANCEL_MESSAGE = "ការស្ទង់មតិត្រូវបានបោះបង់។ វាយពាក្យ /start ដើម្បីចាប់ផ្តើមឡើងវិញ។"
